Terraform plan in __.__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_account_password_policy.tts_iam_password_policy will be updated in-place
  ~ resource "aws_iam_account_password_policy" "tts_iam_password_policy" {
        allow_users_to_change_password = true
        expire_passwords               = true
        hard_expiry                    = false
        id                             = "iam-account-password-policy"
      ~ max_password_age               = 90 -> 89
        minimum_password_length        = 16
        password_reuse_prevention      = 24
        require_lowercase_characters   = true
        require_numbers                = true
        require_symbols                = true
        require_uppercase_characters   = true
    }

  # module.nicholas_kumia.aws_iam_user.default will be created
  + resource "aws_iam_user" "default" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "nicholas.kumia@gsa.gov"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.nicholas_kumia.aws_iam_user_group_membership.default will be created
  + resource "aws_iam_user_group_membership" "default" {
      + groups = [
          + "developers",
        ]
      + id     = (known after apply)
      + user   = "nicholas.kumia@gsa.gov"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [apply #5](https://github.com/GSA/datagov-iam/actions/runs/1478255714)